---
kind: type
id: T:Autodesk.Revit.UI.ItemSelectionDialogResult
source: html/2a3540c1-c4d8-50a8-793b-f662188abfca.htm
---
# Autodesk.Revit.UI.ItemSelectionDialogResult

An enumerated type listing the possible responses from a prompted dialog where the
 user is asked to select one or more items.

## Syntax (C#)
```csharp
public enum ItemSelectionDialogResult
```